Documents/ИА_ЗаявкаНаОбязательства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ИА_ЗаявкаНаОбязательства</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ИА_ИсторияСтатусовЗВС</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_ЦФО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредметЗаказа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фонд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_Фонды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ситуация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Данные</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Решение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИА_СостояниеЗаказа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаОтказа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статья</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КСУ_СтатьиРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Файлы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Записан</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ИА_ИсторияСтатусовЗВС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИА_ИсторияСтатусовЗВС</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИА_СостояниеЗаказа</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаОтказа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЗВС</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИА_ЗаявкаНаОбязательства</v8:Type>
						<v8:Type>cfg:DocumentRef.ИА_ЗаказНаПриобретение</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ИА_СостояниеЗаказа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ИА_СостояниеЗаказа</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Черновик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подготовлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УтвержденРуководителем</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтклоненРуководителем</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РассмотретьНаФП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОдобренЧастично_НетВыплат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОдобренЧастично_ЧастичныеВыплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОдобренЧастично_ВсёВыплачено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОдобренЧастично_Закрыт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОдобренПолностью_НетВыплат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОдобренПолностью_ЧастичныеВыплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОдобренПолностью_ВсёВыплачено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОдобренПолностью_Закрыт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереносНаСледующееФП</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ИА_ЗаявкаНаОбязательства/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ДвиженияСтатусыЗНО = Движения.ИА_ИсторияСтатусовЗВС;
	ДвиженияСтатусыЗНО.Записывать = истина;
	ДвиженияСтатусыЗНО.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИА_ИсторияСтатусовЗВС.Период,
		|	ИА_ИсторияСтатусовЗВС.ЗВС,
		|	ИА_ИсторияСтатусовЗВС.Статус,
		|	ИА_ИсторияСтатусовЗВС.ПричинаОтказа
		|ИЗ
		|	РегистрСведений.ИА_ИсторияСтатусовЗВС КАК ИА_ИсторияСтатусовЗВС
		|ГДЕ
		|	ИА_ИсторияСтатусовЗВС.Регистратор = &Регистратор";
	
	Запрос.УстановитьПараметр("Регистратор", Ссылка);	
	РезультатЗапроса = Запрос.Выполнить();	
	ТаблицаДвиженийДокумента = РезультатЗапроса.Выгрузить();
	
	КоличествоЗаписей = ТаблицаДвиженийДокумента.Количество(); 
	Если КоличествоЗаписей = 0 Тогда
		ПоследнийСтатус = ПредопределенноеЗначение("Перечисление.ИА_СостояниеЗаказа.ПустаяСсылка");
		ПоследняяПричинаОтказа = "";
	иначе
		ПоследнийСтатус = ТаблицаДвиженийДокумента[КоличествоЗаписей - 1].Статус;		 
		ПоследняяПричинаОтказа = ТаблицаДвиженийДокумента[КоличествоЗаписей - 1].ПричинаОтказа;		 
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("Статус") Тогда
		Статус = ДополнительныеСвойства.Статус;
	Иначе
		Статус = ПоследнийСтатус;
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("ПричинаОтказа") Тогда
		ПричинаОтказа = ДополнительныеСвойства.ПричинаОтказа;
	Иначе
		ПричинаОтказа = ПоследняяПричинаОтказа;
	КонецЕсли;
	
	//Если ПоследнийСтатус <> Статус и не (ТаблицаДвиженийДокумента.Найти(Перечисления.ИА_СостояниеЗаказа.Подготовлен)<>Неопределено И Статус = Перечисления.ИА_СостояниеЗаказа.Подготовлен) Тогда
	//	
	//	СтрокаТаблицыДвижений = ТаблицаДвиженийДокумента.Добавить();
	//	СтрокаТаблицыДвижений.Период = ?(Статус = Перечисления.ИА_СостояниеЗаказа.Отклонен, ТекущаяДата(), Дата);
	//	СтрокаТаблицыДвижений.ЗВС = Ссылка;
	//	СтрокаТаблицыДвижений.Статус = Статус;
	//	СтрокаТаблицыДвижений.ПричинаОтказа = ПричинаОтказа;
	//	
	//КонецЕсли;
	
	СтрокаТаблицыДвижений = ДвиженияСтатусыЗНО.Добавить();
	СтрокаТаблицыДвижений.Период = Дата;
	СтрокаТаблицыДвижений.ЗВС = Ссылка;
	СтрокаТаблицыДвижений.Статус = Статус;
	СтрокаТаблицыДвижений.ПричинаОтказа = ПричинаОтказа;
	
	//ДвиженияСтатусыЗНО.Загрузить(ТаблицаДвиженийДокумента);
	ДвиженияСтатусыЗНО.Записать();
	
КонецПроцедуры


Процедура ОбработкаУдаленияПроведения(Отказ)
	
	НовыйСтатус = Неопределено;
	
	Если НЕ ЭтотОбъект.ДополнительныеСвойства.Свойство("Статус",НовыйСтатус) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ИА_ИсторияСтатусовЗВССрезПоследних.Статус
		               |ИЗ
		               |	РегистрСведений.ИА_ИсторияСтатусовЗВС.СрезПоследних(, ЗВС = &ЗВС) КАК ИА_ИсторияСтатусовЗВССрезПоследних";
		
		Запрос.УстановитьПараметр("ЗВС", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если РезультатЗапроса.Пустой() Тогда 
			Возврат;
		КонецЕсли;
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		НовыйСтатус = Выборка.Статус;
		
	КонецЕсли;
	
	Если НовыйСтатус <> Перечисления.ИА_СостояниеЗаказа.Подготовлен Тогда
		
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Отменить проведение документа - " + Ссылка + ", можно только в статусе ""Подготовлен""";
		Сообщение.Сообщить();
		
	КонецЕсли;

КонецПроцедуры
